wrk/output/stage_4/5_range_wrk.txt
Running 30s test @ http://localhost:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 3.217ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.871ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.548ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.433ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.70ms  732.13us   8.01ms   73.71%
    Req/Sec   263.36     54.00   444.00     58.33%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.57ms
 75.000%    2.06ms
 90.000%    2.62ms
 99.000%    3.97ms
 99.900%    6.58ms
 99.990%    7.93ms
 99.999%    8.01ms
100.000%    8.01ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.305     0.000000            2         1.00
       0.910     0.100000         2000         1.11
       1.108     0.200000         4002         1.25
       1.270     0.300000         6000         1.43
       1.422     0.400000         8014         1.67
       1.570     0.500000        10000         2.00
       1.651     0.550000        11011         2.22
       1.740     0.600000        12004         2.50
       1.841     0.650000        13002         2.86
       1.943     0.700000        14001         3.33
       2.063     0.750000        15013         4.00
       2.131     0.775000        15501         4.44
       2.207     0.800000        16010         5.00
       2.297     0.825000        16503         5.71
       2.391     0.850000        17005         6.67
       2.499     0.875000        17498         8.00
       2.567     0.887500        17749         8.89
       2.625     0.900000        18000        10.00
       2.691     0.912500        18249        11.43
       2.769     0.925000        18498        13.33
       2.857     0.937500        18750        16.00
       2.913     0.943750        18875        17.78
       2.983     0.950000        19001        20.00
       3.065     0.956250        19126        22.86
       3.163     0.962500        19249        26.67
       3.271     0.968750        19373        32.00
       3.367     0.971875        19436        35.56
       3.441     0.975000        19497        40.00
       3.505     0.978125        19561        45.71
       3.599     0.981250        19623        53.33
       3.705     0.984375        19684        64.00
       3.779     0.985938        19716        71.11
       3.849     0.987500        19747        80.00
       3.915     0.989062        19778        91.43
       4.049     0.990625        19809       106.67
       4.195     0.992188        19841       128.00
       4.259     0.992969        19856       142.22
       4.355     0.993750        19872       160.00
       4.523     0.994531        19888       182.86
       4.683     0.995313        19903       213.33
       4.839     0.996094        19919       256.00
       4.907     0.996484        19926       284.44
       5.031     0.996875        19934       320.00
       5.159     0.997266        19942       365.71
       5.287     0.997656        19950       426.67
       5.575     0.998047        19957       512.00
       5.651     0.998242        19961       568.89
       5.923     0.998437        19965       640.00
       6.063     0.998633        19969       731.43
       6.287     0.998828        19973       853.33
       6.611     0.999023        19977      1024.00
       6.735     0.999121        19979      1137.78
       6.787     0.999219        19981      1280.00
       6.843     0.999316        19983      1462.86
       7.079     0.999414        19985      1706.67
       7.459     0.999512        19987      2048.00
       7.487     0.999561        19988      2275.56
       7.651     0.999609        19989      2560.00
       7.763     0.999658        19990      2925.71
       7.819     0.999707        19992      3413.33
       7.819     0.999756        19992      4096.00
       7.819     0.999780        19992      4551.11
       7.923     0.999805        19993      5120.00
       7.923     0.999829        19993      5851.43
       7.935     0.999854        19994      6826.67
       7.935     0.999878        19994      8192.00
       7.935     0.999890        19994      9102.22
       8.011     0.999902        19996     10240.00
       8.011     1.000000        19996          inf
#[Mean    =        1.699, StdDeviation   =        0.732]
#[Max     =        8.008, Total count    =        19996]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30004 requests in 30.01s, 1.49MB read
Requests/sec:    999.82
Transfer/sec:     50.77KB